In [16]:
import psycopg2
import pandas as pd
from sqlalchemy import create_engine

billionaire_metadata_path = "data/forbes_billionaires_geo.csv"

# Read the billionaire data
billionaire_metadata = pd.read_csv(billionaire_metadata_path)
bronze_billionaire_df = pd.DataFrame(billionaire_metadata) 
bronze_billionaire_df.head(2) #table is already sorted by net-worth

,Name,NetWorth,Country,Source,Rank,Age,Residence,Citizenship,Status,Children,Education,Self_made,geometry
0,Jeff Bezos,177.0,United States,Amazon,1,57.0,"Seattle, Washington",United States,In Relationship,4.0,"Bachelor of Arts/Science, Princeton University",True,POINT (-122.3300624 47.6038321)
1,Elon Musk,151.0,United States,"Tesla, SpaceX",2,49.0,"Austin, Texas",United States,In Relationship,7.0,"Bachelor of Arts/Science, University of Pennsy...",True,POINT (-97.74369950000001 30.2711286)

In [17]:
bronze_billionaire_df.isnull().sum()

Name              0
NetWorth          0
Country           0
Source            0
Rank              0
Age             125
Residence        40
Citizenship      16
Status          665
Children       1203
Education      1346
Self_made        18
geometry          0
dtype: int64

In [18]:
#persist the raw-unmodified data to the database

password="postgres"
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/Billionaire')
connection = engine.connect()
bronze_billionaire_df.to_sql(name='bronze_billionaire', con=engine, if_exists='replace', index=False)

In [7]:
#Clone to bronze table to proceed with work on the silver version of the data

silver_billionaire_df = bronze_billionaire_df.copy()

In [8]:
#Rename columns
silver_billionaire_df.rename(columns={"Name"      : "Display_Name", 
                                      "Source"    : "Source_Of_Wealth",
                                      "Rank"      : "Wealth_Rank",
                                      "Status"    : "Relationship_Status",
                                      "Self_Made" : "Is_Self_Made",
                                      "NetWorth"  : "Net_Worth",
                                      "Self_made" : "Is_Self_Made",
                                      "geometry"  : "Geometry"},inplace=True)
silver_billionaire_df.head(2)

,Display_Name,Net_Worth,Country,Source_Of_Wealth,Wealth_Rank,Age,Residence,Citizenship,Relationship_Status,Children,Education,Is_Self_Made,Geometry
0,Jeff Bezos,177.0,United States,Amazon,1,57.0,"Seattle, Washington",United States,In Relationship,4.0,"Bachelor of Arts/Science, Princeton University",True,POINT (-122.3300624 47.6038321)
1,Elon Musk,151.0,United States,"Tesla, SpaceX",2,49.0,"Austin, Texas",United States,In Relationship,7.0,"Bachelor of Arts/Science, University of Pennsy...",True,POINT (-97.74369950000001 30.2711286)

In [15]:
#Check for duplicates in silver data

dupes_df = silver_billionaire_df.groupby('Display_Name').filter(lambda x: len(x) > 1).sort_values(by=['Display_Name'])
display(dupes_df)

Empty DataFrame
Columns: [Display_Name, Net_Worth, Country, Source_Of_Wealth, Wealth_Rank, Age, Residence, Citizenship, Relationship_Status, Children, Education, Is_Self_Made, Geometry]
Index: []

In [11]:
#Remove duplidates from Silver

silver_billionaire_df.drop_duplicates(subset="Display_Name",keep=False,inplace=True)

In [14]:
#Drop billionaires from Silver without a value for Residence and Age

silver_billionaire_df.dropna(subset = ['Residence','Age'],inplace=True)
silver_billionaire_df.isnull().sum()

Display_Name              0
Net_Worth                 0
Country                   0
Source_Of_Wealth          0
Wealth_Rank               0
Age                       0
Residence                 0
Citizenship               0
Relationship_Status     566
Children               1076
Education              1227
Is_Self_Made              1
Geometry                  0
dtype: int64

In [ ]:
#Clean the Name column and remove reference for "& family" and "family"
#Source: https://stackoverflow.com/questions/37593550/replace-method-not-working-on-pandas-dataframe

silver_billionaire_df["Display_Name"].replace({"& family": '', "family": ''}, inplace=True, regex=True)
silver_billionaire_df["Display_Name"] = silver_billionaire_df["Display_Name"].str.strip()
silver_billionaire_df.head(2)

In [ ]:
#Create new columns for first name, middle name, and last name
#df1 = pd.DataFrame(columns=['First_Name','Middle_Name','Last_Name','Suffix'])
#silver_billionaire_df = silver_billionaire_df.join(df1, how="outer")

silver_billionaire_df.dtypes

In [ ]:
#Explode the name column to populate first, middle, and last where appropriate

for (idx, data_row) in silver_billionaire_df.iterrows():
    
    name_parts = data_row["Name"].split()
    
    if len(name_parts) == 2:
        
        silver_billionaire_df.at[idx,'First_Name'] = name_parts[0]
        silver_billionaire_df.at[idx,'Last_Name']  = name_parts[1]       

    elif len(name_parts) == 3:
        
        silver_billionaire_df.at[idx,'First_Name']  = name_parts[0]
        
        if "," in name_parts[1]:
            
            cleaned_name = name_parts[1].replace(",",'')
            suffix = name_parts[2]
            
            silver_billionaire_df.at[idx,'First_Name'] = name_parts[0]
            silver_billionaire_df.at[idx,'Last_Name']  = cleaned_name
            silver_billionaire_df.at[idx,'Suffix']     = suffix         
            
        else:
            silver_billionaire_df.at[idx,'First_Name']  = name_parts[0]
            silver_billionaire_df.at[idx,'Middle_Name'] = name_parts[1]
            silver_billionaire_df.at[idx,'Last_Name']   = name_parts[2]

In [ ]:
#Create new columns for longitude and latitude
df1 = pd.DataFrame(columns=['Longitude','Latitude'])
silver_billionaire_df = silver_billionaire_df.join(df1, how="outer")

In [ ]:

for (idx, data_row) in silver_billionaire_df.iterrows():

    point_parts = data_row["Geometry"].split(" ")

    longitude = str(point_parts[1]).replace("(",'') #longitude
    latitude  = str(point_parts[2]).replace(")",'') #latitude
    
    silver_billionaire_df.at[idx,'Longitude'] = longitude
    silver_billionaire_df.at[idx,'Latitude']  = latitude

In [ ]:
display(silver_billionaire_df)

In [ ]:
#Create new columns for City
df1 = pd.DataFrame(columns=['City'])
silver_billionaire_df = silver_billionaire_df.join(df1, how="outer")

In [ ]:
for (idx, data_row) in silver_billionaire_df.iterrows():

    city = data_row["Residence"].split(",")[0]
    silver_billionaire_df.at[idx,'City'] = city

In [ ]:
#reorder dataframe columns

silver_billionaire_df = silver_billionaire_df.reindex(columns=['Name',
                                                               'First_Name',
                                                               'Middle_Name',
                                                               'Last_Name',
                                                               'Suffix',
                                                               'Net_Worth',
                                                               'Country',
                                                               'Residence',
                                                               'Citizenship',
                                                               'Source',
                                                               'Rank',
                                                               'Age',
                                                               'Status',
                                                               'Children',
                                                               'Education',
                                                               'Self_Made',
                                                               'Geometry',
                                                               'Longitude',
                                                               'Latitude'])

In [ ]:
display(silver_billionaire_df)

In [ ]:
password="postgres"
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/Billionaire')
connection = engine.connect()
silver_billionaire_df.to_sql(name='silver_billionaire', con=engine, if_exists='append', index_label='Name')